import 'package:flutter/material.dart';
import 'package:moslem_app/core/constant/app_image.dart';

import 'package:moslem_app/feature/azkar/data/models/am_pm_model.dart';
import 'package:moslem_app/feature/azkar/presentation/widget/azkar_item.dart';
import 'package:moslem_app/feature/azkar/presentation/widget/custom_appBar.dart';

class AmPmView extends StatelessWidget {
   AmPmView({super.key});
  final List<AmPmModel> amPmAzkar = [
    AmPmModel(
      AlZekr:
      "اللّهُمَّ اجْعَلْ في قَلْبِي نورًا وَفي لِسانِي نورًا وَاجْعَلْ في سَمْعِي نورًا وَاجْعَلْ في بَصَرِي نورًا وَاجْعَلْ مِنْ خَلْفِي نورًا وَمِنْ أَمامِي نورًا وَاجْعَلْ مِنْ فَوْقِي نورًا وَمِنْ تَحْتِي نورًا. اللّهُمَّ أعْطِني نورًا",
      AlAgr:
      "من قالها حين يصبح أُجير من الجن حتى يُمسي ومن قالها حين يمسي أُجير من الجن حتى يُصبح",
    ),
    AmPmModel(
      AlZekr:
      "اللهم أنت ربي لا إله إلا أنت خلقتني وأنا عبدك وأنا على عهدك ووعدك ما استطعت أعوذ بك من شر ما صنعت، أبوء لك بنعمتك علي وأبوء بذنبي فاغفر لي، فإنه لا يغفر الذنوب إلا أنت.",
      AlAgr:
      "من قالها موقنًا بها حين يمسي ومات من ليلته دخل الجنة وكذلك حين يصبح.",
    ),
    AmPmModel(
      AlZekr: "اللهم بك أصبحنا وبك أمسينا وبك نحيا وبك نموت وإليك النشور.",
      AlAgr: "يقال صباحًا فقط.",
    ),
    AmPmModel(
      AlZekr: "اللهم بك أمسينا وبك أصبحنا وبك نحيا وبك نموت وإليك المصير.",
      AlAgr: "يقال مساءً فقط.",
    ),
    AmPmModel(
      AlZekr:
      "أصبحنا وأصبح الملك لله والحمد لله، لا إله إلا الله وحده لا شريك له، له الملك وله الحمد وهو على كل شيء قدير، رب أسألك خير ما في هذا اليوم وخير ما بعده، وأعوذ بك من شر ما في هذا اليوم وشر ما بعده، رب أعوذ بك من الكسل وسوء الكبر، رب أعوذ بك من عذاب في النار وعذاب في القبر.",
      AlAgr: "يقال صباحًا فقط.",
    ),
    AmPmModel(
      AlZekr:
      "أمسينا وأمسى الملك لله والحمد لله، لا إله إلا الله وحده لا شريك له، له الملك وله الحمد وهو على كل شيء قدير. رب أسألك خير ما في هذه الليلة وخير ما بعدها، وأعوذ بك من شر ما في هذه الليلة وشر ما بعدها، رب أعوذ بك من الكسل وسوء الكبر، رب أعوذ بك من عذاب في النار وعذاب في القبر.",
      AlAgr: "يقال مساءً فقط.",
    ),
    AmPmModel(
      AlZekr:
      "اللهم إني أسألك العفو والعافية في الدنيا والآخرة، اللهم إني أسألك العفو والعافية في ديني ودنياي وأهلي ومالي، اللهم استر عوراتي، وآمن روعاتي، واحفظني من بين يدي ومن خلفي، وعن يميني وعن شمالي، ومن فوقي، وأعوذ بعظمتك أن أُغتال من تحتي.",
      AlAgr: "يقال صباحًا ومساءً.",
    ),
    AmPmModel(
      AlZekr:
      "بسم الله الذي لا يضر مع اسمه شيء في الأرض ولا في السماء وهو السميع العليم.",
      AlAgr: "من قالها ثلاثًا لم يضره شيء في ذلك اليوم أو في تلك الليلة.",
    ),
    AmPmModel(
      AlZekr: "رضيت بالله ربًا وبالإسلام دينًا وبمحمد صلى الله عليه وسلم نبيًا.",
      AlAgr:
      "من قالها ثلاثًا حين يصبح وثلاثًا حين يمسي كان حقًا على الله أن يرضيه يوم القيامة.",
    ),
    AmPmModel(
      AlZekr:
      "يا حي يا قيوم برحمتك أستغيث، أصلح لي شأني كله، ولا تكلني إلى نفسي طرفة عين.",
      AlAgr: "يقال صباحًا ومساءً.",
    ),
    AmPmModel(
      AlZekr: "سبحان الله وبحمده عدد خلقه ورضا نفسه وزنة عرشه ومداد كلماته.",
      AlAgr: "يقال ثلاث مرات صباحًا.",
    ),
    AmPmModel(
      AlZekr: "سبحان الله وبحمده.",
      AlAgr:
      "من قالها مئة مرة حين يصبح وحين يمسي لم يأت أحد يوم القيامة بأفضل مما جاء به إلا أحد قال مثل ما قال أو زاد عليه.",
    ),
    AmPmModel(
      AlZekr:
      "اللهم إني أصبحت أشهدك وأشهد حملة عرشك وملائكتك وجميع خلقك أنك أنت الله لا إله إلا أنت وحدك لا شريك لك وأن محمدًا عبدك ورسولك.",
      AlAgr: "يقال أربع مرات صباحًا ومساءً.",
    ),
    AmPmModel(
      AlZekr:
      "اللهم ما أصبح بي من نعمة أو بأحد من خلقك فمنك وحدك لا شريك لك، فلك الحمد ولك الشكر.",
      AlAgr: "يقال صباحًا فقط.",
    ),
    AmPmModel(
      AlZekr:
      "اللهم عافني في بدني، اللهم عافني في سمعي، اللهم عافني في بصري، لا إله إلا أنت. اللهم إني أعوذ بك من الكفر والفقر، وأعوذ بك من عذاب القبر، لا إله إلا أنت.",
      AlAgr: "يقال صباحًا ومساءً.",
    ),
    AmPmModel(
      AlZekr: "أعوذ بكلمات الله التامات من شر ما خلق.",
      AlAgr: "يقال ثلاث مرات مساءً فقط.",
    ),
  ];

  @override
  Widget build(BuildContext context) {
    return Directionality(
      textDirection: TextDirection.rtl,
      child: Scaffold(
        appBar: CustomAppBar(
         backgroundImage: AppImage.amImage,
        ),
        backgroundColor: const Color(0xff919F8F),
        body: Padding(
          padding: const EdgeInsets.symmetric(horizontal: 18),
          child: ListView.builder(
            itemBuilder: (context, index) => AzkarItem(
              index: index,
              alAgr: amPmAzkar[index].AlAgr,
              alzker: amPmAzkar[index].AlZekr,
            ),
            itemCount: amPmAzkar.length,
          ),
        ),
      ),
    );
  }
}
